{
  "posts": [
    {
      "id": "1",
      "title": "Como Aprender Programação",
      "text": "Lógica de Programação e Algoritmos: Antes de mergulhar nas linguagens de programação, é essencial entender a lógica por trás da programação. A lógica de programação é como o cérebro do computador funciona. Recomendo começar por aqui.\nEscolha uma Linguagem: Existem várias linguagens de programação, como Python, JavaScript, Java, C++, entre outras. Escolha uma linguagem que se alinhe aos seus objetivos e interesses. Python é uma ótima escolha para iniciantes devido à sua simplicidade e versatilidade.\nRecursos Online Gratuitos:\nSololearn: Um aplicativo móvel gratuito que oferece cursos interativos em várias linguagens de programação.\nCS50 (Harvard): Um curso online gratuito de ciência da computação que abrange conceitos fundamentais.\nProgramming with a Purpose (Princeton): Outro excelente curso online gratuito.\nPlano de Estudos:\nLógica de Programação: Comece com conceitos como loops, condicionais e estruturas de dados.\nHTML e CSS: Aprenda a criar páginas web básicas.\nJavaScript: Explore a linguagem para adicionar interatividade às suas páginas web.\nBanco de Dados: Entenda como armazenar e recuperar informações.\nFrameworks e Bibliotecas: Explore ferramentas como React, Angular ou Django.\nPrática e Projetos: Aprender programação é como aprender um instrumento musical. Pratique regularmente e construa projetos pequenos. Isso ajudará a consolidar seus conhecimentos.\nComunidade e Fóruns: Participe de comunidades online, como o Stack Overflow, onde você pode fazer perguntas e aprender com outros desenvolvedores.\nPersistência e Paciência: A programação pode ser desafiadora, mas não desista. Continue aprendendo, resolvendo problemas e construindo coisas incríveis.\nLembre-se de que cada pessoa tem seu próprio ritmo de aprendizado. Divirta-se explorando o mundo da programação e boa sorte! 🚀👩‍💻",
      "createdAt": 1674672000000,
      "updatedAt": 1710787089364,
      "tags": [
        "2"
      ],
      "author": "João Silva",
      "image": "../imgs/Rectangle-5.png",
      "alt": "mesa com computador"
    },
    {
      "id": "3310",
      "author": "Samilis",
      "title": "A mais linda",
      "tags": [
        "4"
      ],
      "text": "O gato ou gato doméstico é um mamífero carnívoro da família dos felídeos, muito popular como animal de estimação. Ocupando o topo da cadeia alimentar, é predador natural de diversos animais, como roedores, pássaros, lagartixas e alguns insetos.",
      "image": "https://avatars.githubusercontent.com/u/63266170?s=400&u=a2a58d9de8ec726ab991828e1d38d182e93907a0&v=4",
      "alt": "Imagem padrão",
      "createdAt": 1710796349619,
      "updatedAt": 1710810467607
    },
    {
      "id": "abe0",
      "author": "Samilis",
      "title": "dnjvcals sdkcjsaldkcvns sdlkvjsd",
      "tags": [
        "5"
      ],
      "text": "O erro \"Uncaught SyntaxError: Identifier 'BASE_URL' has already been declared\" ocorre quando você tenta declarar uma variável ou constante com o mesmo nome mais de uma vez no mesmo escopo. Isso pode acontecer se você estiver importando um arquivo ou módulo que também declara a mesma variável BASE_URL.\n\nPara corrigir esse erro, verifique se a variável BASE_URL está sendo declarada mais de uma vez no mesmo arquivo ou em arquivos diferentes que são importados no mesmo escopo. Se necessário, renomeie a variável em um dos lugares para evitar conflitos de nome.",
      "image": "https://plus.unsplash.com/premium_photo-1710679068171-b205aeeb3ed2?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "alt": "Imagem padrão",
      "createdAt": 1710804465798,
      "updatedAt": 1710810603916
    },
    {
      "id": "da7e",
      "author": "Samilis",
      "title": "teste da imagem",
      "tags": [
        "5"
      ],
      "text": " Um campo para editar uma URL. O valor inserido é validado para ser vazio ou uma URL absoluta válida antes de ser enviado. Quebras de linha e espaços em branco antes e após o valor inserido são automaticamente removidos. Você pode usar atributos como pattern e maxlength para restringir os valores inseridos no controle. As pseudoclasses CSS :valid e :invalid são aplicadas apropriadamente.",
      "alt": "Imagem padrão",
      "createdAt": 1710809619257,
      "image": "https://plus.unsplash.com/premium_photo-1710361779133-dc0dafa82ee4?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "updatedAt": 1710809812703
    },
    {
      "id": "caf3",
      "image": "https://plus.unsplash.com/premium_photo-1710294628449-a5d79727eab9?q=80&w=1374&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "author": "Samilis",
      "title": "efasdgfas",
      "tags": [
        "5"
      ],
      "text": "asdfasdfsadfas",
      "alt": "Imagem padrão",
      "createdAt": 1710809769795
    }
  ],
  "tags": [
    {
      "id": "1",
      "name": "Programação"
    },
    {
      "id": "2",
      "name": "Aprendizado"
    },
    {
      "id": "3",
      "name": "IA"
    },
    {
      "id": "4",
      "name": "Tecnologia"
    },
    {
      "id": "5",
      "name": "New"
    }
  ]
}